# FamilyType Properties

---
The FamilyType type exposes the following members.
| Name| Description
---|---|---
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Name| The name of the family type.
Top
#### Reference
FamilyType Class
Autodesk.Revit.DB Namespace